In [3]:
import numpy as np
import pandas as pd
import matplotlib as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error,r2_score

In [4]:
# 2. Load dataset

data=pd.read_csv('sample_dataset.csv')

In [6]:
df = pd.DataFrame(data)
df

    Experience  Age Education_Level  Salary
0            1   22        Bachelor   35000
1            2   25        Bachelor   40000
2            3   28          Master   50000
3            4   32          Master   60000
4            5   35             PhD   70000
5            6   40             PhD   80000
6            7   45             PhD   90000
7            8   50        Bachelor  100000
8            9   55          Master  110000
9           10   60             PhD  120000
10          11   65        Bachelor  130000
11          12   70          Master  140000

In [8]:

# Features (X) and target (y)
# Independant Features: 'Experience', 'Age', 'Education_Level'
X = df[['Experience', 'Age', 'Education_Level']]


#Dependent/ Target: 'Salary'
y = df['Salary']

In [9]:
print(X)

    Experience  Age Education_Level
0            1   22        Bachelor
1            2   25        Bachelor
2            3   28          Master
3            4   32          Master
4            5   35             PhD
5            6   40             PhD
6            7   45             PhD
7            8   50        Bachelor
8            9   55          Master
9           10   60             PhD
10          11   65        Bachelor
11          12   70          Master

In [10]:
print(y)

0      35000
1      40000
2      50000
3      60000
4      70000
5      80000
6      90000
7     100000
8     110000
9     120000
10    130000
11    140000
Name: Salary, dtype: int64

In [11]:
# Display the first few rows of features and target

print("Features (X):")
print(X.head())

print("\nTarget (y):")
print(y.head())

Features (X):
   Experience  Age Education_Level
0           1   22        Bachelor
1           2   25        Bachelor
2           3   28          Master
3           4   32          Master
4           5   35             PhD

Target (y):
0    35000
1    40000
2    50000
3    60000
4    70000
Name: Salary, dtype: int64

Handling Categorical Data:'Education_Level'

In [12]:
print(df['Education_Level'])

0     Bachelor
1     Bachelor
2       Master
3       Master
4          PhD
5          PhD
6          PhD
7     Bachelor
8       Master
9          PhD
10    Bachelor
11      Master
Name: Education_Level, dtype: object

In [13]:
# Encoding the categorical variable 'Education_Level'
X = pd.get_dummies(X, columns=['Education_Level'], drop_first=True)

# Now X contains the encoded categorical variables
print(X.head())

   Experience  Age  Education_Level_Master  Education_Level_PhD
0           1   22                       0                    0
1           2   25                       0                    0
2           3   28                       1                    0
3           4   32                       1                    0
4           5   35                       0                    1

Use One-Hot Encoding.
To convert each categorical variable in the Education_Level column to numerical variables without dropping any categories

In [16]:
Edu_level_data= {'Education_Level': ['Bachelor', 'Master', 'PhD', 'Bachelor']}

X=pd.DataFrame(data)


# Apply one-hot encoding without dropping any categories
X_encoded = pd.get_dummies(X, columns=['Education_Level'])

# Display the result
print("Encoded DataFrame:")
print(X_encoded)

Encoded DataFrame:
    Experience  Age  Salary  Education_Level_Bachelor  Education_Level_Master  \
0            1   22   35000                         1                       0
1            2   25   40000                         1                       0
2            3   28   50000                         0                       1
3            4   32   60000                         0                       1
4            5   35   70000                         0                       0
5            6   40   80000                         0                       0
6            7   45   90000                         0                       0
7            8   50  100000                         1                       0
8            9   55  110000                         0                       1
9           10   60  120000                         0                       0
10          11   65  130000                         1                       0
11          12   70  140000                         0                       1

    Education_Level_PhD
0                     0
1                     0
2                     0
3                     0
4                     1
5                     1
6                     1
7                     0
8                     0
9                     1
10                    0
11                    0

In [18]:
df=X_encoded
df

,Experience,Age,Salary,Education_Level_Bachelor,Education_Level_Master,Education_Level_PhD
0,1,22,35000,1,0,0
1,2,25,40000,1,0,0
2,3,28,50000,0,1,0
3,4,32,60000,0,1,0
4,5,35,70000,0,0,1
5,6,40,80000,0,0,1
6,7,45,90000,0,0,1
7,8,50,100000,1,0,0
8,9,55,110000,0,1,0
9,10,60,120000,0,0,1
10,11,65,130000,1,0,0
11,12,70,140000,0,1,0

In [19]:
df.columns

Index(['Experience', 'Age', 'Salary', 'Education_Level_Bachelor',
       'Education_Level_Master', 'Education_Level_PhD'],
      dtype='object')

In [20]:
# Features (independent variables)
X= df[['Experience', 'Age',  'Education_Level_Bachelor',
       'Education_Level_Master', 'Education_Level_PhD']]


# Target (dependent variable)
y = df['Salary']

In [21]:
# 4. Split the Data:

X_train, X_test, y_train, y_test= train_test_split(X,y,test_size=0.2,random_state=42)

In [22]:
#Train the Model:

#Create and train the linear regression model:

model=LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [26]:
#Make Predictions and Evaluate:

#Predict and evaluate the model's performance:

y_pred =model.predict(X_test)

#evaluated the model

mse_res=mean_squared_error(y_test,y_pred)
print(mse_res)

r2_score_res=r2_score(y_test,y_pred)
print(r2_score_res)

8333333.333333455
0.9954128440366972

In [30]:
df.shape

(12, 6)

In [31]:
df.isnull()

,Experience,Age,Salary,Education_Level_Bachelor,Education_Level_Master,Education_Level_PhD
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,False,False,False,False,False
10,False,False,False,False,False,False
11,False,False,False,False,False,False

In [33]:
df.isna().sum()

Experience                  0
Age                         0
Salary                      0
Education_Level_Bachelor    0
Education_Level_Master      0
Education_Level_PhD         0
dtype: int64

Predict sal for new data

In [28]:
# New data in the same format as the training data

new_data ={
    'Experience':[8], 'Age':[30],  'Education_Level_Bachelor':[0],
       'Education_Level_Master':[1], 'Education_Level_PhD':[0]
}


# Create a DataFrame for the new data
new_data_df=pd.DataFrame(new_data)

# Predict using the trained model
salary_prediction = model.predict(new_data_df)

print("Predicted Salary:", salary_prediction[0])

Predicted Salary: 100000.00000000006